## staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 19 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_stream.newrelic_metric_stream[0]`             |
|        | `aws_iam_policy.newrelic_aws_permissions[0]`                         |
|        | `aws_iam_role.firehose_newrelic_role[0]`                             |
|        | `aws_iam_role.metric_stream_to_firehose[0]`                          |
|        | `aws_iam_role.newrelic_aws_role[0]`                                  |
|        | `aws_iam_role.newrelic_configuration_recorder[0]`                    |
|        | `aws_iam_role_policy.metric_stream_to_firehose[0]`                   |
|        | `aws_iam_role_policy.newrelic_configuration_recorder_s3[0]`          |
|        | `aws_iam_role_policy_attachment.newrelic_aws_policy_attach[0]`       |
|        | `aws_iam_role_policy_attachment.newrelic_configuration_recorder[0]`  |
|        | `aws_kinesis_firehose_delivery_stream.newrelic_firehose_stream[0]`   |
|        | `aws_s3_bucket.newrelic_aws_bucket[0]`                               |
|        | `aws_s3_bucket.newrelic_configuration_recorder_s3[0]`                |
|        | `aws_s3_bucket_ownership_controls.newrelic_ownership_controls[0]`    |
|        | `newrelic_api_access_key.newrelic_aws_access_key[0]`                 |
|        | `newrelic_cloud_aws_integrations.newrelic_cloud_integration_pull[0]` |
|        | `newrelic_cloud_aws_link_account.newrelic_cloud_integration_pull[0]` |
|        | `newrelic_cloud_aws_link_account.newrelic_cloud_integration_push[0]` |
|        | `random_string.s3-bucket-name[0]`                                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
15:36:26.376 STDOUT terraform:   + create
15:36:26.376 STDOUT terraform: Terraform will perform the following actions:
15:36:26.376 STDOUT terraform:   # aws_cloudwatch_metric_stream.newrelic_metric_stream[0] will be created
15:36:26.376 STDOUT terraform:   + resource "aws_cloudwatch_metric_stream" "newrelic_metric_stream" {
15:36:26.376 STDOUT terraform:       + arn              = (known after apply)
15:36:26.376 STDOUT terraform:       + creation_date    = (known after apply)
15:36:26.376 STDOUT terraform:       + firehose_arn     = (known after apply)
15:36:26.376 STDOUT terraform:       + id               = (known after apply)
15:36:26.376 STDOUT terraform:       + last_update_date = (known after apply)
15:36:26.376 STDOUT terraform:       + name             = "newrelic-metric-stream-staging"
15:36:26.376 STDOUT terraform:       + name_prefix      = (known after apply)
15:36:26.376 STDOUT terraform:       + output_format    = "opentelemetry0.7"
15:36:26.376 STDOUT terraform:       + region           = "ca-central-1"
15:36:26.376 STDOUT terraform:       + role_arn         = (known after apply)
15:36:26.376 STDOUT terraform:       + state            = (known after apply)
15:36:26.376 STDOUT terraform:       + tags_all         = (known after apply)
15:36:26.376 STDOUT terraform:     }
15:36:26.376 STDOUT terraform:   # aws_iam_policy.newrelic_aws_permissions[0] will be created
15:36:26.376 STDOUT terraform:   + resource "aws_iam_policy" "newrelic_aws_permissions" {
15:36:26.376 STDOUT terraform:       + arn              = (known after apply)
15:36:26.376 STDOUT terraform:       + attachment_count = (known after apply)
15:36:26.376 STDOUT terraform:       + id               = (known after apply)
15:36:26.376 STDOUT terraform:       + name             = "NewRelicCloudStreamReadPermissions-staging"
15:36:26.377 STDOUT terraform:       + name_prefix      = (known after apply)
15:36:26.377 STDOUT terraform:       + path             = "/"
15:36:26.377 STDOUT terraform:       + policy           = jsonencode(
15:36:26.377 STDOUT terraform:             {
15:36:26.377 STDOUT terraform:               + Statement = [
15:36:26.377 STDOUT terraform:                   + {
15:36:26.377 STDOUT terraform:                       + Action   = [
15:36:26.377 STDOUT terraform:                           + "budgets:ViewBudget",
15:36:26.377 STDOUT terraform:                           + "cloudtrail:LookupEvents",
15:36:26.377 STDOUT terraform:                           + "config:BatchGetResourceConfig",
15:36:26.377 STDOUT terraform:                           + "config:ListDiscoveredResources",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeInternetGateways",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeVpcs",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeNatGateways",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeVpcEndpoints",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeSubnets",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeNetworkAcls",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeVpcAttribute",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeRouteTables",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeSecurityGroups",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeVpcPeeringConnections",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeNetworkInterfaces",
15:36:26.377 STDOUT terraform:                           + "ec2:DescribeVpnConnections",
15:36:26.377 STDOUT terraform:                           + "health:DescribeAffectedEntities",
15:36:26.377 STDOUT terraform:                           + "health:DescribeEventDetails",
15:36:26.377 STDOUT terraform:                           + "health:DescribeEvents",
15:36:26.377 STDOUT terraform:                           + "tag:GetResources",
15:36:26.378 STDOUT terraform:                           + "xray:BatchGet*",
15:36:26.378 STDOUT terraform:                           + "xray:Get*",
15:36:26.378 STDOUT terraform:                         ]
15:36:26.378 STDOUT terraform:                       + Effect   = "Allow"
15:36:26.378 STDOUT terraform:                       + Resource = "*"
15:36:26.378 STDOUT terraform:                     },
15:36:26.378 STDOUT terraform:                 ]
15:36:26.378 STDOUT terraform:               + Version   = "2012-10-17"
15:36:26.378 STDOUT terraform:             }
15:36:26.378 STDOUT terraform:         )
15:36:26.378 STDOUT terraform:       + policy_id        = (known after apply)
15:36:26.378 STDOUT terraform:       + tags_all         = (known after apply)
15:36:26.378 STDOUT terraform:         # (1 unchanged attribute hidden)
15:36:26.378 STDOUT terraform:     }
15:36:26.378 STDOUT terraform:   # aws_iam_role.firehose_newrelic_role[0] will be created
15:36:26.378 STDOUT terraform:   + resource "aws_iam_role" "firehose_newrelic_role" {
15:36:26.378 STDOUT terraform:       + arn                   = (known after apply)
15:36:26.378 STDOUT terraform:       + assume_role_policy    = jsonencode(
15:36:26.378 STDOUT terraform:             {
15:36:26.378 STDOUT terraform:               + Statement = [
15:36:26.378 STDOUT terraform:                   + {
15:36:26.378 STDOUT terraform:                       + Action    = "sts:AssumeRole"
15:36:26.378 STDOUT terraform:                       + Effect    = "Allow"
15:36:26.378 STDOUT terraform:                       + Principal = {
15:36:26.378 STDOUT terraform:                           + Service = "firehose.amazonaws.com"
15:36:26.378 STDOUT terraform:                         }
15:36:26.378 STDOUT terraform:                       + Sid       = ""
15:36:26.378 STDOUT terraform:                     },
15:36:26.378 STDOUT terraform:                 ]
15:36:26.378 STDOUT terraform:               + Version   = "2012-10-17"
15:36:26.378 STDOUT terraform:             }
15:36:26.378 STDOUT terraform:         )
15:36:26.378 STDOUT terraform:       + create_date           = (known after apply)
15:36:26.379 STDOUT terraform:       + force_detach_policies = false
15:36:26.379 STDOUT terraform:       + id                    = (known after apply)
15:36:26.379 STDOUT terraform:       + managed_policy_arns   = (known after apply)
15:36:26.379 STDOUT terraform:       + max_session_duration  = 3600
15:36:26.379 STDOUT terraform:       + name                  = "firehose_newrelic_role_staging"
15:36:26.379 STDOUT terraform:       + name_prefix           = (known after apply)
15:36:26.379 STDOUT terraform:       + path                  = "/"
15:36:26.379 STDOUT terraform:       + tags_all              = (known after apply)
15:36:26.379 STDOUT terraform:       + unique_id             = (known after apply)
15:36:26.379 STDOUT terraform:       + inline_policy (known after apply)
15:36:26.379 STDOUT terraform:     }
15:36:26.379 STDOUT terraform:   # aws_iam_role.metric_stream_to_firehose[0] will be created
15:36:26.379 STDOUT terraform:   + resource "aws_iam_role" "metric_stream_to_firehose" {
15:36:26.379 STDOUT terraform:       + arn                   = (known after apply)
15:36:26.379 STDOUT terraform:       + assume_role_policy    = jsonencode(
15:36:26.379 STDOUT terraform:             {
15:36:26.379 STDOUT terraform:               + Statement = [
15:36:26.379 STDOUT terraform:                   + {
15:36:26.379 STDOUT terraform:                       + Action    = "sts:AssumeRole"
15:36:26.379 STDOUT terraform:                       + Effect    = "Allow"
15:36:26.379 STDOUT terraform:                       + Principal = {
15:36:26.379 STDOUT terraform:                           + Service = "streams.metrics.cloudwatch.amazonaws.com"
15:36:26.379 STDOUT terraform:                         }
15:36:26.379 STDOUT terraform:                       + Sid       = ""
15:36:26.379 STDOUT terraform:                     },
15:36:26.379 STDOUT terraform:                 ]
15:36:26.379 STDOUT terraform:               + Version   = "2012-10-17"
15:36:26.379 STDOUT terraform:             }
15:36:26.379 STDOUT terraform:         )
15:36:26.379 STDOUT terraform:       + create_date           = (known after apply)
15:36:26.379 STDOUT terraform:       + force_detach_policies = false
15:36:26.379 STDOUT terraform:       + id                    = (known after apply)
15:36:26.379 STDOUT terraform:       + managed_policy_arns   = (known after apply)
15:36:26.380 STDOUT terraform:       + max_session_duration  = 3600
15:36:26.380 STDOUT terraform:       + name                  = "newrelic_metric_stream_to_firehose_role_staging"
15:36:26.380 STDOUT terraform:       + name_prefix           = (known after apply)
15:36:26.380 STDOUT terraform:       + path                  = "/"
15:36:26.380 STDOUT terraform:       + tags_all              = (known after apply)
15:36:26.380 STDOUT terraform:       + unique_id             = (known after apply)
15:36:26.380 STDOUT terraform:       + inline_policy (known after apply)
15:36:26.380 STDOUT terraform:     }
15:36:26.380 STDOUT terraform:   # aws_iam_role.newrelic_aws_role[0] will be created
15:36:26.380 STDOUT terraform:   + resource "aws_iam_role" "newrelic_aws_role" {
15:36:26.380 STDOUT terraform:       + arn                   = (known after apply)
15:36:26.380 STDOUT terraform:       + assume_role_policy    = jsonencode(
15:36:26.380 STDOUT terraform:             {
15:36:26.380 STDOUT terraform:               + Statement = [
15:36:26.380 STDOUT terraform:                   + {
15:36:26.380 STDOUT terraform:                       + Action    = "sts:AssumeRole"
15:36:26.380 STDOUT terraform:                       + Condition = {
15:36:26.380 STDOUT terraform:                           + StringEquals = {
15:36:26.380 STDOUT terraform:                               + "sts:ExternalId" = "2691974"
15:36:26.380 STDOUT terraform:                             }
15:36:26.380 STDOUT terraform:                         }
15:36:26.380 STDOUT terraform:                       + Effect    = "Allow"
15:36:26.380 STDOUT terraform:                       + Principal = {
15:36:26.380 STDOUT terraform:                           + AWS = "754728514883"
15:36:26.380 STDOUT terraform:                         }
15:36:26.380 STDOUT terraform:                     },
15:36:26.380 STDOUT terraform:                 ]
15:36:26.380 STDOUT terraform:               + Version   = "2012-10-17"
15:36:26.380 STDOUT terraform:             }
15:36:26.380 STDOUT terraform:         )
15:36:26.380 STDOUT terraform:       + create_date           = (known after apply)
15:36:26.380 STDOUT terraform:       + description           = "New Relic Cloud integration role"
15:36:26.381 STDOUT terraform:       + force_detach_policies = false
15:36:26.381 STDOUT terraform:       + id                    = (known after apply)
15:36:26.381 STDOUT terraform:       + managed_policy_arns   = (known after apply)
15:36:26.381 STDOUT terraform:       + max_session_duration  = 3600
15:36:26.381 STDOUT terraform:       + name                  = "NewRelicInfrastructure-Integrations-staging"
15:36:26.381 STDOUT terraform:       + name_prefix           = (known after apply)
15:36:26.381 STDOUT terraform:       + path                  = "/"
15:36:26.381 STDOUT terraform:       + tags_all              = (known after apply)
15:36:26.381 STDOUT terraform:       + unique_id             = (known after apply)
15:36:26.381 STDOUT terraform:       + inline_policy (known after apply)
15:36:26.381 STDOUT terraform:     }
15:36:26.381 STDOUT terraform:   # aws_iam_role.newrelic_configuration_recorder[0] will be created
15:36:26.381 STDOUT terraform:   + resource "aws_iam_role" "newrelic_configuration_recorder" {
15:36:26.381 STDOUT terraform:       + arn                   = (known after apply)
15:36:26.381 STDOUT terraform:       + assume_role_policy    = jsonencode(
15:36:26.381 STDOUT terraform:             {
15:36:26.381 STDOUT terraform:               + Statement = [
15:36:26.381 STDOUT terraform:                   + {
15:36:26.381 STDOUT terraform:                       + Action    = "sts:AssumeRole"
15:36:26.381 STDOUT terraform:                       + Effect    = "Allow"
15:36:26.381 STDOUT terraform:                       + Principal = {
15:36:26.381 STDOUT terraform:                           + Service = "config.amazonaws.com"
15:36:26.381 STDOUT terraform:                         }
15:36:26.381 STDOUT terraform:                       + Sid       = ""
15:36:26.381 STDOUT terraform:                     },
15:36:26.381 STDOUT terraform:                 ]
15:36:26.381 STDOUT terraform:               + Version   = "2012-10-17"
15:36:26.381 STDOUT terraform:             }
15:36:26.381 STDOUT terraform:         )
15:36:26.381 STDOUT terraform:       + create_date           = (known after apply)
15:36:26.381 STDOUT terraform:       + force_detach_policies = false
15:36:26.381 STDOUT terraform:       + id                    = (known after apply)
15:36:26.381 STDOUT terraform:       + managed_policy_arns   = (known after apply)
15:36:26.382 STDOUT terraform:       + max_session_duration  = 3600
15:36:26.382 STDOUT terraform:       + name                  = "newrelic_configuration_recorder-staging"
15:36:26.382 STDOUT terraform:       + name_prefix           = (known after apply)
15:36:26.382 STDOUT terraform:       + path                  = "/"
15:36:26.382 STDOUT terraform:       + tags_all              = (known after apply)
15:36:26.382 STDOUT terraform:       + unique_id             = (known after apply)
15:36:26.382 STDOUT terraform:       + inline_policy (known after apply)
15:36:26.382 STDOUT terraform:     }
15:36:26.382 STDOUT terraform:   # aws_iam_role_policy.metric_stream_to_firehose[0] will be created
15:36:26.382 STDOUT terraform:   + resource "aws_iam_role_policy" "metric_stream_to_firehose" {
15:36:26.382 STDOUT terraform:       + id          = (known after apply)
15:36:26.382 STDOUT terraform:       + name        = "default"
15:36:26.382 STDOUT terraform:       + name_prefix = (known after apply)
15:36:26.382 STDOUT terraform:       + policy      = (known after apply)
15:36:26.382 STDOUT terraform:       + role        = (known after apply)
15:36:26.382 STDOUT terraform:     }
15:36:26.382 STDOUT terraform:   # aws_iam_role_policy.newrelic_configuration_recorder_s3[0] will be created
15:36:26.382 STDOUT terraform:   + resource "aws_iam_role_policy" "newrelic_configuration_recorder_s3" {
15:36:26.382 STDOUT terraform:       + id          = (known after apply)
15:36:26.382 STDOUT terraform:       + name        = "newrelic-configuration-recorder-s3-staging"
15:36:26.382 STDOUT terraform:       + name_prefix = (known after apply)
15:36:26.382 STDOUT terraform:       + policy      = (known after apply)
15:36:26.382 STDOUT terraform:       + role        = (known after apply)
15:36:26.382 STDOUT terraform:     }
15:36:26.382 STDOUT terraform:   # aws_iam_role_policy_attachment.newrelic_aws_policy_attach[0] will be created
15:36:26.382 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "newrelic_aws_policy_attach" {
15:36:26.382 STDOUT terraform:       + id         = (known after apply)
15:36:26.382 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
15:36:26.383 STDOUT terraform:       + role       = "NewRelicInfrastructure-Integrations-staging"
15:36:26.383 STDOUT terraform:     }
15:36:26.383 STDOUT terraform:   # aws_iam_role_policy_attachment.newrelic_configuration_recorder[0] will be created
15:36:26.383 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "newrelic_configuration_recorder" {
15:36:26.383 STDOUT terraform:       + id         = (known after apply)
15:36:26.383 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/service-role/AWS_ConfigRole"
15:36:26.383 STDOUT terraform:       + role       = "newrelic_configuration_recorder-staging"
15:36:26.383 STDOUT terraform:     }
15:36:26.383 STDOUT terraform:   # aws_kinesis_firehose_delivery_stream.newrelic_firehose_stream[0] will be created
15:36:26.383 STDOUT terraform:   + resource "aws_kinesis_firehose_delivery_stream" "newrelic_firehose_stream" {
15:36:26.383 STDOUT terraform:       + arn            = (known after apply)
15:36:26.383 STDOUT terraform:       + destination    = "http_endpoint"
15:36:26.383 STDOUT terraform:       + destination_id = (known after apply)
15:36:26.383 STDOUT terraform:       + id             = (known after apply)
15:36:26.383 STDOUT terraform:       + name           = "newrelic_firehose_stream_staging"
15:36:26.383 STDOUT terraform:       + region         = "ca-central-1"
15:36:26.383 STDOUT terraform:       + tags_all       = (known after apply)
15:36:26.383 STDOUT terraform:       + version_id     = (known after apply)
15:36:26.383 STDOUT terraform:       + http_endpoint_configuration {
15:36:26.383 STDOUT terraform:           + access_key         = (sensitive value)
15:36:26.383 STDOUT terraform:           + buffering_interval = 60
15:36:26.383 STDOUT terraform:           + buffering_size     = 1
15:36:26.383 STDOUT terraform:           + name               = "New Relic staging"
15:36:26.383 STDOUT terraform:           + retry_duration     = 300
15:36:26.383 STDOUT terraform:           + role_arn           = (known after apply)
15:36:26.383 STDOUT terraform:           + s3_backup_mode     = "FailedDataOnly"
15:36:26.383 STDOUT terraform:           + url                = "https://aws-api.newrelic.com/cloudwatch-metrics/v1"
15:36:26.384 STDOUT terraform:           + cloudwatch_logging_options (known after apply)
15:36:26.384 STDOUT terraform:           + request_configuration {
15:36:26.384 STDOUT terraform:               + content_encoding = "GZIP"
15:36:26.384 STDOUT terraform:             }
15:36:26.384 STDOUT terraform:           + s3_configuration {
15:36:26.384 STDOUT terraform:               + bucket_arn         = (known after apply)
15:36:26.384 STDOUT terraform:               + buffering_interval = 400
15:36:26.384 STDOUT terraform:               + buffering_size     = 10
15:36:26.384 STDOUT terraform:               + compression_format = "GZIP"
15:36:26.384 STDOUT terraform:               + role_arn           = (known after apply)
15:36:26.384 STDOUT terraform:               + cloudwatch_logging_options (known after apply)
15:36:26.384 STDOUT terraform:             }
15:36:26.384 STDOUT terraform:           + secrets_manager_configuration (known after apply)
15:36:26.384 STDOUT terraform:         }
15:36:26.384 STDOUT terraform:     }
15:36:26.384 STDOUT terraform:   # aws_s3_bucket.newrelic_aws_bucket[0] will be created
15:36:26.384 STDOUT terraform:   + resource "aws_s3_bucket" "newrelic_aws_bucket" {
15:36:26.384 STDOUT terraform:       + acceleration_status         = (known after apply)
15:36:26.384 STDOUT terraform:       + acl                         = (known after apply)
15:36:26.384 STDOUT terraform:       + arn                         = (known after apply)
15:36:26.384 STDOUT terraform:       + bucket                      = (known after apply)
15:36:26.384 STDOUT terraform:       + bucket_domain_name          = (known after apply)
15:36:26.384 STDOUT terraform:       + bucket_prefix               = (known after apply)
15:36:26.384 STDOUT terraform:       + bucket_region               = (known after apply)
15:36:26.384 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
15:36:26.384 STDOUT terraform:       + force_destroy               = true
15:36:26.384 STDOUT terraform:       + hosted_zone_id              = (known after apply)
15:36:26.384 STDOUT terraform:       + id                          = (known after apply)
15:36:26.384 STDOUT terraform:       + object_lock_enabled         = (known after apply)
15:36:26.384 STDOUT terraform:       + policy                      = (known after apply)
15:36:26.385 STDOUT terraform:       + region                      = "ca-central-1"
15:36:26.385 STDOUT terraform:       + request_payer               = (known after apply)
15:36:26.385 STDOUT terraform:       + tags_all                    = (known after apply)
15:36:26.385 STDOUT terraform:       + website_domain              = (known after apply)
15:36:26.385 STDOUT terraform:       + website_endpoint            = (known after apply)
15:36:26.385 STDOUT terraform:       + cors_rule (known after apply)
15:36:26.385 STDOUT terraform:       + grant (known after apply)
15:36:26.385 STDOUT terraform:       + lifecycle_rule (known after apply)
15:36:26.385 STDOUT terraform:       + logging (known after apply)
15:36:26.385 STDOUT terraform:       + object_lock_configuration (known after apply)
15:36:26.385 STDOUT terraform:       + replication_configuration (known after apply)
15:36:26.385 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
15:36:26.385 STDOUT terraform:       + versioning (known after apply)
15:36:26.385 STDOUT terraform:       + website (known after apply)
15:36:26.385 STDOUT terraform:     }
15:36:26.385 STDOUT terraform:   # aws_s3_bucket.newrelic_configuration_recorder_s3[0] will be created
15:36:26.385 STDOUT terraform:   + resource "aws_s3_bucket" "newrelic_configuration_recorder_s3" {
15:36:26.385 STDOUT terraform:       + acceleration_status         = (known after apply)
15:36:26.385 STDOUT terraform:       + acl                         = (known after apply)
15:36:26.385 STDOUT terraform:       + arn                         = (known after apply)
15:36:26.385 STDOUT terraform:       + bucket                      = (known after apply)
15:36:26.385 STDOUT terraform:       + bucket_domain_name          = (known after apply)
15:36:26.385 STDOUT terraform:       + bucket_prefix               = (known after apply)
15:36:26.385 STDOUT terraform:       + bucket_region               = (known after apply)
15:36:26.385 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
15:36:26.385 STDOUT terraform:       + force_destroy               = true
15:36:26.385 STDOUT terraform:       + hosted_zone_id              = (known after apply)
15:36:26.385 STDOUT terraform:       + id                          = (known after apply)
15:36:26.385 STDOUT terraform:       + object_lock_enabled         = (known after apply)
15:36:26.386 STDOUT terraform:       + policy                      = (known after apply)
15:36:26.386 STDOUT terraform:       + region                      = "ca-central-1"
15:36:26.386 STDOUT terraform:       + request_payer               = (known after apply)
15:36:26.386 STDOUT terraform:       + tags_all                    = (known after apply)
15:36:26.386 STDOUT terraform:       + website_domain              = (known after apply)
15:36:26.386 STDOUT terraform:       + website_endpoint            = (known after apply)
15:36:26.386 STDOUT terraform:       + cors_rule (known after apply)
15:36:26.386 STDOUT terraform:       + grant (known after apply)
15:36:26.386 STDOUT terraform:       + lifecycle_rule (known after apply)
15:36:26.386 STDOUT terraform:       + logging (known after apply)
15:36:26.386 STDOUT terraform:       + object_lock_configuration (known after apply)
15:36:26.386 STDOUT terraform:       + replication_configuration (known after apply)
15:36:26.386 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
15:36:26.386 STDOUT terraform:       + versioning (known after apply)
15:36:26.386 STDOUT terraform:       + website (known after apply)
15:36:26.386 STDOUT terraform:     }
15:36:26.386 STDOUT terraform:   # aws_s3_bucket_ownership_controls.newrelic_ownership_controls[0] will be created
15:36:26.386 STDOUT terraform:   + resource "aws_s3_bucket_ownership_controls" "newrelic_ownership_controls" {
15:36:26.386 STDOUT terraform:       + bucket = (known after apply)
15:36:26.386 STDOUT terraform:       + id     = (known after apply)
15:36:26.386 STDOUT terraform:       + region = "ca-central-1"
15:36:26.386 STDOUT terraform:       + rule {
15:36:26.386 STDOUT terraform:           + object_ownership = "BucketOwnerEnforced"
15:36:26.386 STDOUT terraform:         }
15:36:26.386 STDOUT terraform:     }
15:36:26.386 STDOUT terraform:   # newrelic_api_access_key.newrelic_aws_access_key[0] will be created
15:36:26.386 STDOUT terraform:   + resource "newrelic_api_access_key" "newrelic_aws_access_key" {
15:36:26.386 STDOUT terraform:       + account_id  = (sensitive value)
15:36:26.386 STDOUT terraform:       + id          = (known after apply)
15:36:26.386 STDOUT terraform:       + ingest_type = (known after apply)
15:36:26.387 STDOUT terraform:       + key         = (sensitive value)
15:36:26.387 STDOUT terraform:       + key_type    = "USER"
15:36:26.387 STDOUT terraform:       + name        = "notify_tf_provider"
15:36:26.387 STDOUT terraform:       + notes       = "Used by Notify Terraform Code to create New Relic Resources"
15:36:26.387 STDOUT terraform:       + user_id     = (known after apply)
15:36:26.387 STDOUT terraform:     }
15:36:26.387 STDOUT terraform:   # newrelic_cloud_aws_integrations.newrelic_cloud_integration_pull[0] will be created
15:36:26.387 STDOUT terraform:   + resource "newrelic_cloud_aws_integrations" "newrelic_cloud_integration_pull" {
15:36:26.387 STDOUT terraform:       + account_id        = (sensitive value)
15:36:26.387 STDOUT terraform:       + id                = (known after apply)
15:36:26.387 STDOUT terraform:       + linked_account_id = (known after apply)
15:36:26.387 STDOUT terraform:       + lambda {
15:36:26.387 STDOUT terraform:           + fetch_tags               = true
15:36:26.387 STDOUT terraform:           + metrics_polling_interval = 300
15:36:26.387 STDOUT terraform:         }
15:36:26.387 STDOUT terraform:     }
15:36:26.387 STDOUT terraform:   # newrelic_cloud_aws_link_account.newrelic_cloud_integration_pull[0] will be created
15:36:26.387 STDOUT terraform:   + resource "newrelic_cloud_aws_link_account" "newrelic_cloud_integration_pull" {
15:36:26.387 STDOUT terraform:       + account_id             = (sensitive value)
15:36:26.387 STDOUT terraform:       + arn                    = (known after apply)
15:36:26.387 STDOUT terraform:       + id                     = (known after apply)
15:36:26.387 STDOUT terraform:       + metric_collection_mode = "PULL"
15:36:26.387 STDOUT terraform:       + name                   = "staging pull"
15:36:26.387 STDOUT terraform:     }
15:36:26.387 STDOUT terraform:   # newrelic_cloud_aws_link_account.newrelic_cloud_integration_push[0] will be created
15:36:26.387 STDOUT terraform:   + resource "newrelic_cloud_aws_link_account" "newrelic_cloud_integration_push" {
15:36:26.387 STDOUT terraform:       + account_id             = (sensitive value)
15:36:26.388 STDOUT terraform:       + arn                    = (known after apply)
15:36:26.388 STDOUT terraform:       + id                     = (known after apply)
15:36:26.388 STDOUT terraform:       + metric_collection_mode = "PUSH"
15:36:26.388 STDOUT terraform:       + name                   = "staging metric stream"
15:36:26.388 STDOUT terraform:     }
15:36:26.388 STDOUT terraform:   # random_string.s3-bucket-name[0] will be created
15:36:26.388 STDOUT terraform:   + resource "random_string" "s3-bucket-name" {
15:36:26.388 STDOUT terraform:       + id          = (known after apply)
15:36:26.388 STDOUT terraform:       + length      = 8
15:36:26.388 STDOUT terraform:       + lower       = true
15:36:26.388 STDOUT terraform:       + min_lower   = 0
15:36:26.388 STDOUT terraform:       + min_numeric = 0
15:36:26.388 STDOUT terraform:       + min_special = 0
15:36:26.388 STDOUT terraform:       + min_upper   = 0
15:36:26.388 STDOUT terraform:       + number      = true
15:36:26.388 STDOUT terraform:       + numeric     = true
15:36:26.388 STDOUT terraform:       + result      = (known after apply)
15:36:26.388 STDOUT terraform:       + special     = false
15:36:26.388 STDOUT terraform:       + upper       = false
15:36:26.388 STDOUT terraform:     }
15:36:26.388 STDOUT terraform: Plan: 19 to add, 0 to change, 0 to destroy.
15:36:26.388 STDOUT terraform: Warning: Argument is deprecated
15:36:26.388 STDOUT terraform:   with aws_s3_bucket.csv_bucket,
15:36:26.388 STDOUT terraform:   on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
15:36:26.388 STDOUT terraform:    5: resource "aws_s3_bucket" "csv_bucket" {
15:36:26.388 STDOUT terraform: lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
15:36:26.388 STDOUT terraform: resource instead.
15:36:26.388 STDOUT terraform: (and 61 more similar warnings elsewhere)
15:36:26.388 STDOUT terraform: Warning: Deprecated attribute
15:36:26.388 STDOUT terraform:   on .terraform/modules/notify_slack_critical.lambda/outputs.tf line 9, in output "lambda_function_arn_static":
15:36:26.388 STDOUT terraform:    9:   value       = local.create && var.create_function && !var.create_layer ? "arn:aws:lambda:${data.aws_region.current.name}:${data.aws_caller_identity.current.account_id}:function:${var.function_name}" : ""
15:36:26.389 STDOUT terraform: The attribute "name" is deprecated. Refer to the provider documentation for
15:36:26.389 STDOUT terraform: details.
15:36:26.389 STDOUT terraform: (and 17 more similar warnings elsewhere)
15:36:26.389 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
15:36:26.389 STDOUT terraform: Saved the plan to: plan.tfplan
15:36:26.389 STDOUT terraform: To perform exactly these actions, run the following command to apply:
15:36:26.389 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.route53_nxdomain_notification[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.route53_servfail_notification[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.cloudwatch_data_scanned"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
